/******************************************************************************/
/*	File Name    :  GL_charge_process.h		                      */
/*	Discription  :  罐笼充电过程控制		                      */


/*					                                      */
/*	Project Name :	罐笼充电接收		                                      */
/*	Version      :	1.0			                              */
/*	MCU          :	ST 8-bit STM8S104K4T6C	                              */
/*	Clock        :	16MHz			                              */
/*	Author	     :	caiweijie base mengzhuozhuo   		                              */
/*      Date	     :	2016/04/26	                                      */
/*	Corporation  :	中惠创智（深圳）无线供电技术有限公司                  */

/*						                              */
/******************************************************************************/
/*******************************************************************************
-----------------------------     File start    --------------------------------
 *******************************************************************************/
#ifndef GL_CHARGE_PROCESS_H_
#define GL_CHARGE_PROCESS_H_


/*******************************************************************************
-----------------------------    Macro define    -------------------------------
 *******************************************************************************/

//无充电时电池电压可进行充电的安全最低点 10.5v
//电池电压充电安全高点 13.5v
//电池充电最大电流 3.5A
//电池恒压充电结束的电流门限 0.35A

#define LED_Normal PC_ODR_ODR4
#define LED_Exception PC_ODR_ODR3
#define LED_Charging PC_ODR_ODR2
#define LED_Full PC_ODR_ODR1
#define Fan_PWM PD_ODR_ODR3
//#define Switch_charge PD_ODR_ODR7
/*******************************************************************************
-------------------------    Function declaration    ---------------------------
 *******************************************************************************/
void GL_charge_process();
void POSTest(); //1：开机自检 power on self test
void standby(); //2：待机
void pairing(); //3：配对
void CC_CVcharging(); //4：恒压恒流充电
void chargeComplete(); //6：充电完成
void exception(); //7：异常
void recovery(); //8：异常恢复
void testcharge();
#endif
/*******************************************************************************
-----------------------------    End of file    --------------------------------
 *******************************************************************************/
