/******************************************************************************/
/*					                                      */
/*	Project Name :	发射机		                                      */
/*	Version      :	1.0			                              */
/*	MCU          :	ST 8-bit STM8S104K4T6C	                              */
/*	Clock        :	16MHz			                              */
/*	Author	     :	mengzhuozhuo   		                              */
/*      Date	     :	2016/04/26	                                      */
/*	Corporation  :	中惠创智（深圳）无线供电技术有限公司                    */
/*						                              */
/******************************************************************************/
/*******************************************************************************
-----------------------------     File start    --------------------------------
*******************************************************************************/


/*******************************************************************************
-----------------------------    Include files   -------------------------------
*******************************************************************************/
#include "type_def.h"
#include "Eeprom.h"

//******************************************************************************
//EEPROM初始化（解密）
//******************************************************************************
void  Eeprom_Init(void)
{
    FLASH_CR1 =0X00;
    FLASH_CR2 =0X00;
    FLASH_NCR2 =0Xff;
    FLASH_DUKR=0XAE;//写入第一个密钥
    asm("nop");
    asm("nop");
    asm("nop");
    asm("nop");
    asm("nop");		
    FLASH_DUKR=0X56;//写入第二个密钥
    while(!(FLASH_IAPSR&0X08));//等待解密就绪		
}
//******************************************************************************


//******************************************************************************
//保密检测
//******************************************************************************
void  UniqueID_Check(void)
{
    unsigned int data;
    data = CHECK_ID[1]*256 + CHECK_ID[2];
    if(Flag_10ms_B == 1)
    {
        Flag_10ms_B = 0;
        //*************************************************
        //短时间检测方法
        if(CHECK_ID[0] == 0xa5)
        {
            if(data == Key_Check_ID1)
            {
               //短时间检测方法正常
                asm("nop");
            }
            else
            {
                Flag_Eeprom_Ero = 1;
            }
        }
        else
        {
            Flag_Eeprom_Ero = 1;
        }
        //*************************************************
        
        //*************************************************
        //长时间检测方法
        if((Flag_1hour_A ==1)||(Flag_Eeprom_Check == 1))
        {
            Flag_1hour_A = 0;
            GetEeprom(CHECK_ID);        //读取EEprom中数据（共6个数据）
            data = CHECK_ID[4]*256 + CHECK_ID[5];
            if(data >= C_EEP_PROECT_TIME)
            {
                if(CHECK_ID[3] == Key_Check_ID2)
                {
                    //长时间检测方法正常
                    Flag_Eeprom_Check = 0;
                    CNT_Eeprom_Check = 0;
                }
                else
                {
                    Flag_Eeprom_Check = 1;
                    CNT_Eeprom_Check++;
                    if(CNT_Eeprom_Check >= 10)
                    {
                        CNT_Eeprom_Check = 10;
                        Flag_Eeprom_Ero = 1;
                    }
                    else
                    {
                    }
                }
            }
            else
            {
                data++;
                CHECK_ID[4] = data>>8;//高位
                CHECK_ID[5] = data&0xff;//低位
                Eeprom_Write(4,CHECK_ID[4]);
                Eeprom_Write(5,CHECK_ID[5]);
            }
        }
    }
}
//******************************************************************************


//******************************************************************************
//EEPROM写数据
//******************************************************************************
void Eeprom_Write(unsigned char addr,unsigned char dat)
{
    unsigned char *p;
    p = (unsigned char *)(0X4000 + addr);
    *p = dat;
    asm("nop");
    asm("nop");
    asm("nop");
    asm("nop");
    asm("nop");
    while(!(FLASH_IAPSR&0X04));
}
//******************************************************************************


//******************************************************************************
//EEPROM读数据
//******************************************************************************
void GetEeprom(unsigned char *p)
{
    unsigned char i;
    unsigned char *pIDStart=(unsigned char *)(EEPROM_BaseAddress);
    for(i=0;i <=5;i++)
    {
        *p++=*pIDStart++;
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
    }
}
//******************************************************************************


//******************************************************************************
//获取器件ID
//******************************************************************************
void GetUniqueID(unsigned char *p)
{
    unsigned char i;
    unsigned char *pIDStart=(unsigned char *)(ID_BaseAddress);    
    for(i=0;i!=12;i++)
    {
        *p++=*pIDStart++;
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
    }
}
//******************************************************************************


//******************************************************************************
//校验方式二
//******************************************************************************
unsigned char crc_check_value(unsigned char *data_value, unsigned char data_length)
{
    unsigned char  i,TCheckCode;
    TCheckCode =0;
    for(i = 0; i < data_length; i++)
    {
        TCheckCode ^=ChipUniqueID[i];  // check code calculate
    }
    return TCheckCode;
}
//******************************************************************************


//******************************************************************************
//校验方式三
//******************************************************************************
unsigned int crc_sum_value(unsigned char *buf,unsigned char len)
{
    unsigned char i;
    unsigned int sum;
    sum =0;
    for(i=0;i<len;i++)
    {
        sum += *buf++;
    }
    return sum;
}
/*******************************************************************************
-----------------------------    End of file    --------------------------------
*******************************************************************************/