/******************************************************************************/
/*					                                      */
/*	Project Name :	发射机		                                      */
/*	Version      :	1.0			                              */
/*	MCU          :	ST 8-bit STM8S104K4T6C	                              */
/*	Clock        :	8MHz			                              */
/*	Author	     :	renhai   		                              */
/*  Date	     :	2016/10/9	                                      */
/*	Corporation  :	中惠创智（深圳）无线供电技术有限公司                   */
/*						                              */
/******************************************************************************/
/*******************************************************************************
-----------------------------     File start    --------------------------------
*******************************************************************************/


/*******************************************************************************
-----------------------------    Include files   -------------------------------
*******************************************************************************/
#include "QueueMsg.h"

int enQueue(TSqQueue *pQ, TQElemType *pE)
{ // 插入元素*pE为pQ的新的队尾元素。
	if(isFull(pQ))
		return 0;

	pQ->base[pQ->rear] = *pE;
	pQ->rear = (pQ->rear + 1) % MAXQSIZE;
	return 1;
}

int deQueue(TSqQueue *pQ, TQElemType *pE)
{ // 若队列不空，则删除pQ的队头元素，用pE指向其值，并返回1；
  // 否则返回0。
	if(isEmpty(pQ))
		return 0;

	*pE = pQ->base[pQ->front];
	pQ->front = (pQ->front + 1) % MAXQSIZE;
	return 1;
}

int isFull(TSqQueue *pQ)
{
	return (pQ->rear + 1) % MAXQSIZE == pQ->front;
}

int isEmpty(TSqQueue *pQ)
{
	return pQ->front == pQ->rear;
}

/*************增加两个队列，1：放置imu数据，2：放置gps数据*********************************/
TSqQueue queSEND = {{{0, 0, 0, 0}}, 0, 0}; // IMU消息队列
/*******************************************************************************
-----------------------------    End of file    --------------------------------
*******************************************************************************/