/******************************************************************************/
/*					                                      */
/*	Project Name :	发射机		                                      */
/*	Version      :	1.0			                              */
/*	MCU          :	ST 8-bit STM8S104K4T6C	                              */
/*	Clock        :	16MHz			                              */
/*	Author	     :	mengzhuozhuo   		                              */
/*  Date	     :	2016/04/26	                                      */
/*	Corporation  :	中惠创智（深圳）无线供电技术有限公司                    */
/*						                              */
/******************************************************************************/
/*******************************************************************************
-----------------------------     File start    --------------------------------
*******************************************************************************/
#ifndef _SYSINIT_H
#define _SYSINIT_H


/*******************************************************************************
-----------------------------    Macro define    -------------------------------
*******************************************************************************/

/*******************************************************************************
-------------------------    Function declaration    ---------------------------
*******************************************************************************/
void    SysInit(void);//初始化
void	Clock_Init(void);//系统时钟初始化16M内部/外部
void	Port_Init(void);//IO口初始化
void	EXTI3_Init(void);//外部中断初始化
void	AD_Init(void);//AD采样初始化
void	SPI_Init(void);//SPI初始化
void	Variable_Init(void);//清RAM变量值初始化
void	Time1_Init(void);//2路互补PWM输出初始化
void	Time2_Init(void);//1路PWM初始化
void	Time4_Init(void);//定时器初始化定时1ms
void    Time3_Init(void);//定时器初始化定时1ms
void	IWDG_Init(void);//独立看门狗初始化
void    Delay(unsigned int);
void    Variable_Init_Second(void);
unsigned char CheckRecvDate(unsigned char *pCode);//date check

//void _delay_ms(unsigned long ms);
//void  _delay_1_ms(void);
//void _delay_us(unsigned long us);
//******************************************************************************
//函数名：CheckRecvDate
//功能：校验数据正确性
//输入：CheckRecvDate
//返回值：正确的数据
//******************************************************************************

void streamTodecode(unsigned char *pFrmCode);//decode the recv date
//******************************************************************************
//函数名：streamTodecode
//功能：将数据pFrmCode解码
//输入：pFrmCode收到的数据
//返回值：无
//******************************************************************************

int IsNewAddr(unsigned char *Resv_Address);//if or not a new adress
//******************************************************************************
//函数名：IsNewAddr
//功能：判断Resv_Address是否为已存在的配对地址，如果是则在内部返回0，超出设定个数返回2，新地址返回1，
//输入：Resv_Address地址内容为5个字节
//返回值：根据不同情况返回0,1,2
//******************************************************************************

int Find_Max(int *LostP,int k);//make know who is the max in the lost-squeue
//******************************************************************************
//函数名：Find_Max
//功能：在LostP中查找最大值
//输入：LostP最大值所在队列,k队列中元素个数
//返回值：最大值
//******************************************************************************

unsigned short CalculatedPower(const unsigned short *current,const unsigned short *voltage);
//******************************************************************************
//函数名：CalculatedPower
//功能：根据数据电压和电流计算功率，并返回功率值
//输入：current(I),voltage（V）
//返回值：功率值 = I*V
//******************************************************************************

void ProtectLowVoltage(const unsigned short *voltage);
//******************************************************************************
//函数名：ProtectLowVoltage
//功能：当电压低于某一特定值（160V）时，发出一长一短告警
//输入：voltage（V）
//输出：无
//******************************************************************************

short GetPwmValueFromIGBTtemp(const unsigned short *IgbtValue);
//******************************************************************************
//函数名：GetPwmValueFromIGBTtemp
//功能：判断IGBT采集温度的数值并作出相应的反应，发出一长两短告警
//输入：IgbtValue（V），电压值，需转化成温度值
//输出：返回不同PWM调节值
//******************************************************************************

short GetPwmValueFromCOILtemp(const unsigned short *CoilValue);
//******************************************************************************
//函数名：GetPwmValueFromCOILtemp
//功能：判断线圈采集温度的数值并作出相应的反应，发出一长两短告警
//输入：CoilValue（V），电压值，需转化成温度值
//输出：返回不同PWM调节值
//******************************************************************************

void Cycle_Deal_FormDate(const unsigned char *fromRSdate);
//******************************************************************************
//Cycle_Deal_FormDate
//功能：获取配对设备的占空比，比例为1:4
//输入：fromRSdate，存储接收数据
//输出：占空比
//******************************************************************************
#endif
/*******************************************************************************
-----------------------------    End of file    --------------------------------
*******************************************************************************/